In [1]:
import pandas as pd
import numpy as np
data = pd.read_csv('/media/sumanthvrao/Personal/PESU/SEMESTER 5/DA/PROJECT/We_R_Pythons/DataSet/data.csv')
item = pd.read_csv('/media/sumanthvrao/Personal/PESU/SEMESTER 5/DA/PROJECT/We_R_Pythons/DataSet/item.csv',encoding='windows-1252')
user = pd.read_csv('/media/sumanthvrao/Personal/PESU/SEMESTER 5/DA/PROJECT/We_R_Pythons/DataSet/user.csv')
genre = pd.read_csv('/media/sumanthvrao/Personal/PESU/SEMESTER 5/DA/PROJECT/We_R_Pythons/DataSet/genre.csv')
occupation = pd.read_csv('/media/sumanthvrao/Personal/PESU/SEMESTER 5/DA/PROJECT/We_R_Pythons/DataSet/occupation.csv')

In [2]:
#number of unique users 
print(data.head())
print("----------------")
print(data.T.apply(lambda x:x.nunique(),axis=1)[0])

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596
----------------
943

In [3]:
#Mimium number of ratings given by a user is 19
counts = data.groupby(['user_id']).agg(['count']).idxmin()[0]
print(counts)

19

In [4]:
#number of unique movies
print(item[1:2]) #information about a single movie
print(item.T.apply(lambda x:x.nunique(),axis=1)[0])
print("----------------")
#genre of movies
print(genre[1:]["genre"])

   movie_id       movie_title release_date  \
1         2  GoldenEye (1995)    01-Jan-95

                                  video_release_date  imdb_url  unknown  \
1  http://us.imdb.com/M/title-exact?GoldenEye%20(...         0        1

   Action  Adventure  Animation  Children's   ...     Fantasy  Film-Noir  \
1       1          0          0           0   ...           0          0

   Horror  Musical  Mystery  Romance  Sci-Fi  Thriller  War  Western
1       0        0        0        0       1       0.0  0.0      NaN

[1 rows x 24 columns]
1682
----------------
1          Action
2       Adventure
3       Animation
4      Children's
5          Comedy
6           Crime
7     Documentary
8           Drama
9         Fantasy
10      Film-Noir
11         Horror
12        Musical
13        Mystery
14        Romance
15         Sci-Fi
16       Thriller
17            War
18        Western
Name: genre, dtype: object

In [5]:
#user information
print(user.T.apply(lambda x:x.nunique(),axis=1)[0]) #verified to be 943 across datasets
print("----------------")
print(user.head())
user.groupby(['gender']).agg(['count'])["user_id"]
#273 females and 670 males

943
----------------
   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

        count
gender
F         273
M         670

In [6]:
#mean age
np.mean(user["age"])
print("----------------")
#occupation of the users 
user.groupby(['occupation']).agg(['count'])["user_id"].sort_values('count',ascending=False)
#clearly most number of student users

----------------

               count
occupation
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7